ConvergentChannel/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes 
{
    default                                             steadyState;
}

ddtSchemes 
{
    default                                             steadyState;
}

gradSchemes
{
    default                                             Gauss linear;
}

divSchemes
{
    default                                             none;
    div(phi,e)                                          bounded Gauss upwind;
    div(phi,omega)                                      bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))                       Gauss linear;
    div(phi,gammaInt)                                   bounded Gauss upwind;
    div(phi,h)                                          bounded Gauss upwind;
    div((phi|interpolate(rho)),p)                       Gauss upwind;
    div(phi,k)                                          bounded Gauss upwind;
    div(phi,epsilon)                                    bounded Gauss upwind;
    div(phi,U)                                          bounded Gauss linearUpwindV grad(U);
    div(phid,p)                                         bounded Gauss upwind;
    div(phi,T)                                          bounded Gauss upwind;
    div(phi,ReThetat)                                   bounded Gauss upwind;
    div(pc)                                             bounded Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U)))))                 Gauss linear;
    div(phi,nuTilda)                                    bounded Gauss upwind;
    div(phi,K)                                          bounded Gauss upwind;
    div(phi,Ekp)                                        bounded Gauss upwind;
    div(sigmaD)                                         Gauss linear;
}

interpolationSchemes
{
    default                                             linear;
}

laplacianSchemes
{
    default                                             Gauss linear corrected;
}

snGradSchemes
{
    default                                             corrected;
}

fluxRequired
{
    default                                             no;
    p;
    p_rgh;
    Phi;
}

wallDist
{
    method                                              meshWave;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
